Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 시아야~
en_us: sia!

source: 나처럼 뚱뚱하고 못생긴 애가...?
en_us: a fat, ugly kid... like me?

source: 그나저나 나…
en_us: I thought...

source: 난리잖아.
en_us: it’s total chaos in the comments.

source: 민호방 첫 개시!!
en_us: woohoo! I made it in before you!!!

source: 튼튼이
en_us: Good

source: 빠악!
en_us: THWACK

source: 이때만을 기다렸다!!
en_us: I’ve been waiting for this all year!

source: 응응, 갔다와~
en_us: okay, go for it!

source: 그 전에 그 놈들 나한테 다 뒤졌어!!!
en_us: nah, I’m gonna beat them all to a pulp first!!!

source: 14화
en_us: Episode 14

source: 284,562개 댓글 123451개 공유 421회
en_us: 285K 123451 comments 421 shares

source: 허허...
en_us: haha...

source: 크-
en_us: hah!

source: 마지막 날까지 D-35
en_us: 35 days left.

source: 역대_웹툰남주중_가장_최악의_고백법.jpg
en_us: the_worst_confession_by_any_webtoon_male_lead_ever.jpg

source: 너...
en_us: you...

source: 오늘만 가지 말까…?
en_us: should I just skip it today?

source: 어쩔 수 없지,
en_us: can’t help it!

source: 하루도 빠짐 없이 유산소 운동을 해주었다.
en_us: ...and did aerobic exercises every single day.

source: 7.6M 156 공유 저장
en_us: 7.6M 156 Share Save

source: 두자릿 수의 사나이라네~
en_us: losing weight so fast~

source: 룰루 랄라
en_us: toodle~ dee~ toodle~ doo~

source: 3화
en_us: Episode 3

source: 김예현
en_us: Yehyeon Kim

source: 수고하셨습니다.
en_us: thank you.

source: 청춘 헬스장 3F 튼튼이치과 2F
en_us: Gym of Youth 3F Good Dentist 2F

source: 예쁜 이름 정도는 가지고 있어야지.
en_us: I needed a prettier name.

source: 너무 걱정하지 마~
en_us: don’t worry too much.

source: 나, 나도 모르겠어!!!
en_us: I-I don’t know either!!!

source: 그만두고 싶었던 순간들이 아주 많았지^^
en_us: well, I did want to quit a few times.

source: 구독자 49.9만명
en_us: 499k subscribers

source: 하핫!
en_us: oh, haha!

source: 안 그래도 살이 잘 안 빠지는데…
en_us: I’m not losing much weight right now...

source: 팟팅!
en_us: I can do it!

source: 뭐야, 쟤네… 강보배 무리 아냐?
en_us: what the heck... aren’t they bobae’s friends?

source: 내가 급이 맞다고?
en_us: ...and I are at the same level?

source: 내가 재볼게.
en_us: let me check my weight.

source: 좋은 남자는 널리고 널렸어!
en_us: there are tons more good men in the world!

source: 정말이지!?
en_us: really?!

source: 크리스마스니까 더 해야지, 이벤트 보상을 받아야 하거든~
en_us: yes, because it’s christmas! I can earn more rewards during the holiday specials!

source: 시아쨩이 성환쿤이 어떤 사람인지 궁금하대…!
en_us: sia-chan wants to get to know you, seonghwan-kun!

source: 오타쿠인 나도 이 게시글은 본 적 있어!
en_us: ... so popular that even I, an otaku, saw this post!

source: 윤시아 녀석'?
en_us: “that sia kid”?

source: 그런데 너 여기서 뭐하냐?
en_us: but what are you doing here?

source: 당연하지!
en_us: of course!

source: 주말인데 집이 휑하네...
en_us: it’s the weekend, but no one’s here...

source: ㅋㅋㅋㅋ웃기지, 말 안 되긴 해~ 농담이야 농담ㅋㅋ
en_us: funny, huh? I know it’s nonsense. I was just kidding, haha!

source: 자 이제 그만 그만~
en_us: okay, that’s enough!

source: 얌
en_us: NOM

source: 미안한데, 너 뒤 구린 거 구독자들이 알면 어떻게 될 거 같냐?
en_us: sorry to say this, but what do you think would happen if your subscribers found out how rotten you are?

source: 으 존못ㅋㅋ;
en_us: ugh, so ugly, haha!

source: 제발 그것만은...!!!
en_us: please! no!!!

source: 에...
en_us: huh?

source: 네가 좋아할 것 같았으니까,
en_us: because I thought you’d like it.

source: 퍽퍽
en_us: WHACK WHACK

source: 나 살 빠졌잖아!!!
en_us: I already lost weight!!!

source: 9화
en_us: Episode 9

source: 소화기
en_us: FIRE EXTINGUISHER

source: 응응, 예전에 제이유가 공개했던 다이어트 식단이 인터넷에서 화제가 됐었잖아.
en_us: yup! remember? her meal plan was all over the internet.

source: 그냥 라면이 아니야!!
en_us: they’re not just any noodles!!!

source: 잠깐만요...
en_us: wait...

source: 고인정
en_us: Injeong Go

source: 뭐어, 싫다고...?
en_us: wh-what? no?

source: 감귤주스
en_us: Tangerine Juice

source: 그나저나
en_us: by the way

source: 앞으로도 이대로만 해~
en_us: let’s keep up the good work!

source: 데이트 아냐!?
en_us: is it... for a date?!

source: 팍 쒸, 뭘 보냐?
en_us: what you starin’ at?

source: 중요한 건 몸무게가 아니고
en_us: your weight isn’t what’s important.

source: 우다다
en_us: SPRINT

source: 다시 한 번 열심히 해볼게!!
en_us: I’ll stick to your plan really well this time!!!

source: 요리를 잘 하나보네...
en_us: you must cook well...

source: 안돼애애애애
en_us: NOOOOOOO

source: 어쩌겠어, 다른 사람 찾아봐~ 난 워낙 바쁘잖냐~
en_us: sorry. you’ll have to find someone else! ‘cause I’m busy!

source: 살 빠지고 나서 이목구비 드러나니까 꽤 잘생겨지긴 했어~
en_us: his features show through now that he lost weight, so he does look quite handsome.

source: 아메카지룩!!
en_us: vintage american style!!!

source: 난 항상 춤을 춰~ 두통이 오더라도~
en_us: I always dance~ until my head aches~

source: 그러고보니 시아쨩은 오늘 하루 어땠어?
en_us: come to think of it... what did you think of today, sia-chan?

source: 쏴아아
en_us: POUR

source: 우오오!!!
en_us: whoaaaa!!!

source: 맞네, 맞아~
en_us: yeah, that’s so true!

source: 앞으로 한 달간 내 루틴 잘 지키겠다고 약속해.
en_us: so, promise me that you’ll follow it for the next month.

source: 벌써 끝났어?
en_us: I’m done already?

source: 걔한텐 더 말 못하지!!!
en_us: of course I can’t tell her!!!

source: 네가 이 밤에 우리 집에...
en_us: why are you here...

source: 내일은 좀 어렵고ㅠ 운동가느라..
en_us: I can’t tmrw... working out...

source: 프로젝트 성공하면 둘이 사귀기로 했다고 들은 거 같은데…
en_us: I thought she agreed to date him if the project is successful...

source: 히익...?
en_us: ack!

source: 어어…?
en_us: huh?

source: 중단
en_us: Stop

source: 너도 그만한 걸 해줘야지.
en_us: ...you should reciprocate.

source: 빰 빰
en_us: BAM BAM

source: 뭐, 뭐어~!?
en_us: wh-what?!

source: 너 이번에 윤시아랑 헤어졌잖아.
en_us: ...wanted to ask about why you and sia broke up.

source: 헤어졌다니까 바로 관심 대폭발이네...
en_us: ...but everyone’s hyper-focused on me because of the breakup?

source: 자, 잠깐 시아쨩!!
en_us: w-wait, sia-chan!!!

source: 다음 룩으로는
en_us: next outfit!

source: 지금은 변화가 더디게 느껴질 수도 있지만...
en_us: it might feel slow right now...

source: 또?
en_us: again?

source: 그래도 이정도면 많이 나아진거야.
en_us: well, at least I’m doing a lot better than before.

source: 으읏, 빨리 빨리!
en_us: come on! hurry up!

source: 김지훈 여자 카톡X
en_us: Jihun Kim No msgs from girls plz

source: 우당탕!!
en_us: RUSH

source: 그 돼지는?
en_us: ...doing with a pig?

source: 꿀꺽
en_us: GULP

source: 너에게 어울리는 남자로 만들어줘!!
en_us: just turn me into someone who deserves to be with you!!

source: 은행
en_us: Bank

source: 네엥...
en_us: okay...

source: 나 왔어~
en_us: I’m here!

source: 의외네~
en_us: that’s kind of surprising.

source: 미안하지만…
en_us: sorry to say...

source: 기, 긴장 풀고...
en_us: r-relax...

source: 제가 뭘 잘 아는 건 아니지만...
en_us: I don’t know all that well...

source: 아무튼 있어!!!
en_us: just a friend!!!

source: 뉴비
en_us: Noob

source: 아직 크리스마스 이벤트가 끝나지 않았잖아!!
en_us: the xmas promo isn’t over yet!!!

source: 어디긴~
en_us: I said...

source: 아무리 봐도 시아는 날 좋아하지 않는 것 같았고...
en_us: and no matter how I think of it, sia didn’t seem to like me at all...

source: 변신!!
en_us: morph!!!

source: 나도 같이 보러가도 돼…?
en_us: can I... go with you to see it?

source: 우씨!
en_us: UGH

source: 우, 우응!!
en_us: o-okay!

source: 그것만은...!!!
en_us: no, please don’t!!!

source: 두
en_us: DA

source: 오늘은 그만 뛸래...
en_us: enough running today...

source: 그러니까 쓰러지기나 하지!
en_us: that’s why you blacked out!

source: 강건욱
en_us: Geonuk Kang

source: 구독자 48.2만명
en_us: 482k subscribers

source: 에!?
en_us: huh?!

source: ...에?
en_us: huh?

source: 성환쿤은 우리 덕후들 사이에서도 제일가는 노래 실력을 가졌어.
en_us: he’s the best singer of all us geeks.

source: 문화생활~
en_us: a cultural experience!

source: 정해진 날에만 체중체크 하기.
en_us: ...check body weight only on designated days.

source: 아앗, 나 전화 좀 받고 올게!
en_us: oops, let me take this call. I’ll be right back!

source: 시아쨩
en_us: Sia-chan

source: 나는야~
en_us: I’m~

source: 내 말대로 안하면 네 옷 속에 요거 넣어버린다!?
en_us: if you don’t do as I say, I’m going to put this down your pants!

source: 안 그래도 서서히 강도를 높이는 식으로 패턴 변화를 주려고 했는데,
en_us: I was thinking of changing up your routine anyway.

source: 진짜 귀엽지 않아?
en_us: isn’t he so cute?

source: 좋아, 그럼 오늘부터 작전 개시다-!
en_us: okay, then let’s take action right away!

source: 두둑
en_us: DA DUN

source: 후훗
en_us: HEHE

source: 평소에 저탄수 식단을 했다면 탄수화물 비율을 적당히 늘려보는 거지.
en_us: or if you’ve been eating a low carb diet, then you can try eating a little more carbs.

source: 체지방량도 많이 줄어든게 보이지?
en_us: look, he has a lot less body fat too.

source: 역시 나랑 같이 하길 잘 했지!?
en_us: see? aren’t you glad you joined me in this project?

source: 그 시기?
en_us: that period?

source: 너도 알다시피...
en_us: you already know this...

source: 뭔가...
en_us: it feels like...

source: 네 동생 텐션 진짜 높다.
en_us: your sister’s really energetic.

source: 유, 윤시아…?
en_us: s-sia yoon?

source: 그러게~ 운동법 바꾼 게 효과가 있었나!?
en_us: changing the workout routine must have been effective!!!

source: 아이고
en_us: uh-oh

source: 싸인해주세요!!
en_us: can I get your autograph?!

source: 가능합니다.
en_us: possible.

source: 경악
en_us: SHOOK

source: 어때?
en_us: what do you think?

source: 뭐래~
en_us: whateverrr!

source: 잘 해보자!!
en_us: so let’s keep going!!!

source: 으으으
en_us: UHHH

source: 까먹었음
en_us: she forgot

source: 뭐야…
en_us: geez...

source: 정말 든든하겠죠?
en_us: it’s quite filling.

source: 너 지금 네 몸무게 보고도 치킨이 넘어가!!!??
en_us: you want to eat fried chicken after seeing your weight right now?!!!

source: 별빛 내과
en_us: Medical Cl

source: 천상계 인싸 윤시아가…!!
en_us: sia yoon, the angel from the in-crowd...

source: 크리스마스에 민호킁을 왜 불렀겠어!?
en_us: why else would she want to c u on xmas, minho-kun?!

source: 죄송해요 저희가 바빠서요ㅎㅎ..
en_us: sorry, but we’re busy now, hehe...

source: 그 시기를 버틸수 있었을까 싶어.
en_us: I think it would’ve been difficult for me to endure that period of my life.

source: 웅성 웅성 웅성
en_us: MURMUR MURMUR MURMUR

source: 천 원…!?
en_us: a dollar?!

source: 근데 쟤 김민호 아냐?
en_us: but isn’t that minho kim?

source: 어휴, 얘!
en_us: gosh, minho!

source: 나를 봐!!
en_us: look at me!!!

source: 크리스마스인데?
en_us: on christmas?

source: 핑크미 천호점
en_us: PINK ME CHEONHO BRANCH

source: 헉
en_us: GASP

source: 훌쩍
en_us: SNIFFLE

source: 친구 누구?
en_us: which friend?

source: 넌 혼자가 아니야! *일본어
en_us: you’re not alone! *japanese

source: 앗~ 다메다메다메~
en_us: hah! dame, dame, dame~

source: 누, 누구지?
en_us: wh-who is that?

source: 너랑 다르게 나는 나 혼자 힘으로 45만 찍었으니까!
en_us: and unlike you, I hit 450k on my own!

source: 그럴 바에야 애초에 도전하지 않는게 좋지.
en_us: so it’s better not to even try at all.

source: 오늘 할일 많구만!!
en_us: I have lots to do today!

source: 더 보기
en_us: Read more

source: 13화
en_us: Episode 13

source: 그런데 너희들은 노래 안 불러?
en_us: but why aren’t you guys singing?

source: 몸도 마음도 건강해지는 기분이 듭니다.ㅎ
en_us: I can feel my body and mind becoming healthier. :)

source: 나코나코니~
en_us: nako nakoni~

source: 시시커플 SISICouple 구독
en_us: SISI Couple SUBSCRIBE

source: 만약...
en_us: if I...

source: 너저분~
en_us: MESSY

source: 정말!?
en_us: really?!

source: 고시원
en_us: Rooms

source: 버는 족족 엄마 병원비에 다 썼대.
en_us: so all the money my dad and uncle earned from their small taekwondo studio...

source: 너 애니펑 말고 할 줄 아는 게임이 있긴 해?
en_us: but tic-tac-toe is the only game you know.

source: 시아를 포기하는게 좋겠지?
en_us: I should give up on sia, right?

source: 속닥 속닥
en_us: WHISPER WHISPER

source: 어서!!
en_us: now!!!

source: 니…
en_us: what...

source: 밍…
en_us: SNIFFLE

source: 영원히 함께할 거라 믿어왔었다.
en_us: I thought we’d be friends forever.

source: 민호킁!
en_us: minho-kun!

source: 실시간 스트리밍 시작
en_us: Begin Livestream

source: 지금은 바야흐로 뉴튜브 전성시대.
en_us: ‘tis the golden age of newtube.

source: 샤이닝 스타~ 버블 스타~
en_us: shining star~ bubble star~

source: 너, 너..!!
en_us: y-you...!!!

source: 화면발 잘 받겠는걸?
en_us: I think I’ll look nice on camera!

source: 쳇!
en_us: BLEH

source: 알쥐 알쥐~
en_us: I know, I know.

source: 팡
en_us: PAT

source: 짜증나
en_us: I hate this!

source: 스트레스 받아가면서 할 필요는 없잖아.
en_us: why go through all that stress?

source: 짝 짝
en_us: SLAP SLAP

source: 신기하당~
en_us: it’s amazing!

source: (SNS 안 함)
en_us: (doesn’t use social media)

source: 곧 기말고사니까~
en_us: finals are coming up!

source: 영상도 잘 찍혔고~
en_us: and the video will turn out great!

source: 먹, 먹을까…?
en_us: sh-should I...?

source: 몰라, 걔 비호감…
en_us: no, her vids rub me the wrong way...

source: 알고 있겠지만 난 아무나 안 사귀어.
en_us: well, I’m sure you already know, but I can’t date just anyone.

source: 시, 싫어!!!
en_us: n-nooo!!!

source: 후후
en_us: HAHA

source: 좋기는 한데...
en_us: it’s great...

source: 시아님 또 오셨네요~
en_us: sia, you’re here again!

source: 민호가 갑자기 왜 이런 모습으로 변하게 됐는지는 아직 모르겠지만,
en_us: I don’t know why minho changed so much...

source: 나에겐…!!
en_us: I have to...

source: 까불고 있어!
en_us: who do you think you’re dealing with?

source: 좋아한다구...!
en_us: I like you-!

source: 다음 날...!
en_us: the next day

source: 노래방?
en_us: karaoke?

source: 시간은 없는데 당장 새로운 방법은 안 떠오르고...
en_us: I don’t have any better ideas right now and we don’t have much time...

source: 든든한 지원군을 얻은 기분인데...?
en_us: ...I found myself a trusty ally!

source: 광고는 들어왔어?!
en_us: have you gotten any sponsors?

source: 네?
en_us: pardon?

source: 2화
en_us: Episode 2

source: 키미노짱 보다보니 귀여운 구석이 있달까?
en_us: the more i watch kiminho-chan, the more i notice how cute he is!

source: 관리하는 남자를 싫어하는 여자는 없지.
en_us: no woman dislikes a man who keeps himself in tip-top shape.

source: 나도 멋있어져서 당당하게 너랑 사귀고 싶어.
en_us: I want to become handsome. I want to feel confident about being your boyfriend.

source: 이 녀석들은...
en_us: they’re...

source: 으엑, 뭐야!
en_us: what the-?

source: 지, 진짠데...
en_us: b-but it’s true...

source: 전국의 개성있는 고등학생들이
en_us: a time where nearly all high schoolers throughout the country...

source: 아까부터 다들 날 쳐다보고 있는 거 같아...
en_us: they’re all staring at me...

source: 강건욱님 외 67명 댓글 85개
en_us: Geonuk Kang and 67 others 85 comments

source: 내가...
en_us: I...

source: 그만 좀 찡찡대구!!
en_us: stop whining!

source: 최근 검색어 전체삭제
en_us: Recent searches Clear all

source: 솔 솔
en_us: WHIFF WHIFF

source: 걱정도 많다.
en_us: don’t worry about it.

source: 내 이름은 오성환, 민호의 하나 뿐인 절친이다.
en_us: ...but my name is seonghwan oh. I’m his one and only best friend.

source: 어이!!
en_us: hut!!!

source: 데려와!
en_us: bring him here!

source: 그래, 그냥 우리 집 가서 놀자… 같이 샤브도 먹고…
en_us: fine, let’s just hang out at my place... and have shabu shabu together...

source: 시시커플 Sisi couple
en_us: SISI Couple

source: 한 가지 큰 변화가 생겼다.
en_us: ...there was one big change.

source: 설탕과 밀가루 음식 줄이기, 현미밥 먹기 등등...
en_us: reduce sugar and wheat products, eat brown rice, etc...

source: 사실 협찬 받은 곳이기도 하고...
en_us: and to be honest, they want to do a collab with us...

source: 이제 나 따위는 안중에도 없는 건가-
en_us: does that mean he won’t care about me anymore?

source: 축하해~
en_us: congrats.

source: 인테리어도 완전 잉스타 감성이고 디저트가 맛있대!
en_us: I hear the desserts are delicious and the interior design is perfect for social media!

source: 43.7kg
en_us: 96.3 lbs

source: 사람이 정말 많다
en_us: ...who come out on weekend mornings.

source: 진짜지, 진짜!?
en_us: really? seriously?!

source: 우응, 오늘 꽤나 성공적이었거든!
en_us: yeah. it was very good!

source: 다 망했어...
en_us: it failed...

source: 바로 제이유 다이어트야!!!
en_us: ...is j.u.’s diet!!!

source: 한동안 잉스타 셀카도 못 찍게 만들어 줘야지.
en_us: make it so she can’t take any instargram selfies for the time being.

source: 약속이 있는 듯 한껏 꾸미고 나온 사람들과,
en_us: some are dressed up for an appointment.

source: 창업문의:
en_us: Business Inquiries:

source: 털썩!
en_us: PLOP

source: 그나저나 이다음엔 어디 갈까?
en_us: anyway, where are we going next?

source: 지금까지 함께였고, 같이 성장했었다.
en_us: we were with each other all the time and grew up together.

source: 이효주
en_us: hyoju lee

source: 아침엔 꼭 클래식 음악을 듣습니다.
en_us: I always start my day with some classical music.

source: 그렇다니까…
en_us: yeah...

source: 걔가 긁지 않은 복권일지도.
en_us: he might be a hidden gem.

source: 젠장-
en_us: dammit!

source: 평소와 별 다를 것 없는 등굣길이지만...
en_us: ...and walk the same path to school.

source: *라면 싫어함
en_us: *hates instant noodles

source: 그래…
en_us: okay...

source: 어쨌든간에...
en_us: at any rate...

source: 본판이 훨 나아요ㄹㅇ..
en_us: she looks so much better without

source: 오늘 먹은 점심…
en_us: today’s lunch...

source: 헉…
en_us: GASP

source: 안녕하세요, 윤시아님!
en_us: Hello, Sia!

source: 그 이후로 민호는...
en_us: from that moment on, minho...

source: 저녁 고구마
en_us: Dinner 1 sweet potato

source: 오늘도 김민호 방에서 발견된 나코짱
en_us: Nako-chan spotted in Minho Kim’s room again!

source: 시아쨩, 더 찾아왔어!
en_us: sia-chan! I found more!

source: 난 정말 간절하단 말이야!!
en_us: but I’m really desperate!!!

source: 뭐 하는 거야, 우리 방 앞에서…
en_us: what are they doing in front of our room...?

source: 헤에...
en_us: HEHE...

source: 어우~ 유치해!!
en_us: ugh! so childish!!!

source: 그래도 아침에 걸으니까 좋다.
en_us: still, taking a walk in the morning feels nice.

source: 으응… 왜?
en_us: yeah... why?

source: 구린 집이라니…
en_us: awful...?

source: 어, 어떡해...!
en_us: what should I do?

source: 과한 운동을 하지도 않았는데 살이 빠졌어...!!!
en_us: I didn’t even exercise too much and yet... I still lost weight!!!

source: 벌써 열여덟살이 되었다!
en_us: ...became 18 years old!

source: 우아아앙~~!!
en_us: waaaah!!!

source: 물 좀 마셔가면서 움직여~
en_us: have some water as you exercise.

source: 계획에 차질이 생기는 걸 원치 않는데...
en_us: I don’t want any hiccups in my plans.

source: 오늘은 치팅데이니까 기뻐하라구!
en_us: today’s your cheat day! rejoice!

source: 내가 초딩 때 매일 데려오던 그 잘생긴 애!!!
en_us: that good-looking kid I always brought over when I was in elementary school!!!

source: 너 나랑 백시원 헤어졌다고 지금 장난 치는 거지?
en_us: are you making fun of me because siwon and I broke up?

source: 메리 크리스마스!!!
en_us: merry christmas!!!

source: 어떡해...
en_us: oh, no...

source: 부끄렁~
en_us: ahhh! it’s making me shyyy!

source: 그래~ 내 그럴 줄 알았다~ 너희는 왜 매일 못 잡아 먹어서 안달이냐?
en_us: yeah, that’s what I thought. you two can’t go a day without biting at each other, huh?

source: 나 사실...
en_us: honestly...

source: 오…일본어 노래네?
en_us: oooh... it’s a japanese song?

source: 저기, 시아쨩…
en_us: uh... sia-chan...

source: 이번 정체기만 잘 이겨내면 분명 더 큰 변화가 생길 거니까.
en_us: if you can overcome this phase of your diet, you’ll definitely start changing even more.

source: 으음…
en_us: hmmm...

source: 잊고 살아온 첫사랑을!!!
en_us: my long-lost first love!!!

source: 안녕!
en_us: hi!

source: 쭈욱
en_us: STRETCH

source: 성환킁...
en_us: seonghwan-kun...

source: 윤시아다!
en_us: it’s sia!

source: 쿠당탕
en_us: TUMBLE

source: 민하다!
en_us: it’s minha!

source: 좋아!
en_us: good!

source: 애초에 입을 옷도 별로 없네.
en_us: he doesn’t have much to begin with as well...

source: 시아쨩...!
en_us: sia-chan...!

source: 그, 그치만...
en_us: b-but...

source: 찐라면 마일드 참치
en_us: Spicy Noodles Real Tuna

source: 그게 누구냐니!
en_us: what? you don’t know?!

source: 마…
en_us: that...

source: 김민호 관찰기록
en_us: My observations of Minho Kim

source: 최근에는 헬스 콘텐츠도 시작했어!
en_us: but they recently started uploading health and fitness content as well!

source: 화악!
en_us: STOMP

source: 2.5천 83개
en_us: 2.5K 83 Replies

source: 네~
en_us: yes, miss!

source: 미쳤어!?
en_us: no way!!!

source: 흰우유
en_us: MILK

source: 바카, 안 찍던 걸 찍으니 어쩔 수 없는 거다.
en_us: baka (fool), you can’t help it. you’ve never taken pictures of yourself before.

source: 누구세요!?
en_us: who are you?!

source: 아…
en_us: oh...

source: 닭가슴살을 주고 갔어!!!
en_us: he gave you chicken breast!!!

source: 우와, 진짜요!??
en_us: wow! really?!!!

source: 방구석 오타쿠 김민호의
en_us: ...and minho kim, an introverted otaku...

source: 아~ 글쿠낭~
en_us: aha! I see.

source: 뭐, 뭐…!?
en_us: wh-what?!

source: 네가 처맞아야 할 이유가 이렇게 많아ㅋㅋㅋㅋ
en_us: that’s why you deserve a good beating! hahaha!

source: 아무 이유 없이 살이 쪘을리가 없어.
en_us: there has to be a reason why he gained weight.

source: 에가오 토도게루 야자와 나코나코~
en_us: egao todogeru yazawa nako nako~

source: 또 만만한 애 골라 잡아서 괴롭히고 있나보네.
en_us: they must be picking on another easy target.

source: 그런 나를 설레게 한 남자가 한명 있었다.
en_us: then... I met a boy who made my heart flutter.

source: 왜요??
en_us: what is it, ms. sia?

source: 우리랑 같은 나이 맞냐고...
en_us: they’re the same age as us...

source: 그래서 할 말이 뭔데?
en_us: so what did you want to say to me?

source: 고생했다, 이거 마셔
en_us: good work. here, drink this.

source: 탁탁
en_us: TAP TAP

source: 거친 쇠질 소리와...
en_us: the sound of heavy metal...

source: 조급한 것은 시아도 마찬가지였다.
en_us: ...sia felt just as anxious.

source: 오늘 같이 등교하자고 톡 했자나, 왜 먼저 갔어~
en_us: didn’t you see my text about coming to school together? why’d you leave first?

source: 구세군 자선냄비
en_us: Salvation Army Donation Kettle

source: 으윽...
en_us: ugh...

source: 나도 민호랑 콘텐츠 같이 한 이후부터 구독자 5만명이나 더 늘었어~
en_us: I also gained about 50,000 more subscribers since I started making content with minho.

source: 자, 잠깐...
en_us: w-wait...

source: 안 가면 섭하긴 해~
en_us: it doesn’t feel right if we don’t go.

source: 나랑 얘기 좀 하자.
en_us: let’s have a talk,

source: 열받으니까...!!
en_us: it makes me mad!!!

source: 내가 뭐 잘못했어?
en_us: did I do something wrong?

source: 우리 집은 나 어릴 때부터 엄마가 아파서
en_us: my mom was ill since I was really young.

source: 지나가는 행인이랑 시비 붙은 줄…
en_us: I thought he was picking a fight with you.

source: 응, 학원 마쳤나봐.
en_us: yeah, she must be done with the academy.

source: 매순간마다 시아가 떠오를 뿐...
en_us: although sia popped into mind every moment of the day...

source: 심하게 많이 움직이는...
en_us: ...and exercised a lot.

source: 방과후에 뒤뜰에서 기다릴게
en_us: I’ll wait for you in the back yard after school

source: 올~ 네가 웬 일이래?
en_us: oooh, really?

source: 명색이 인플루언서인데…
en_us: even though I’m an influencer...

source: 잡곡 주류/음료
en_us: Grains Beverages

source: 멋있는 남자가 될 거라고!!
en_us: that I’ll become a handsome guy!!

source: 네넵!!!
en_us: yessir!!!

source: 그래도...
en_us: but still...

source: 아무리 그래도 어떻게 날 못 알아보니!?
en_us: how could you not recognize me?!

source: 순번대기표 없이 티켓판매기로!
en_us: No more lines! Use the kiosk!

source: 다음 영상은 언제 올라오나요!
en_us: when will you upload your next video?

source: 급하게 가게 돼서 인사를 못 하게 된 걸 많이 아쉬워하더구나...
en_us: it was a sudden move, so he felt bad that he couldn’t say goodbye...

source: 근데 생각보다 빡세다.
en_us: but your routine is harder than I thought.

source: sia**** 가볍게 들기좋은 에코백!:3 #말차베어 에코 #광고
en_us: sia**** This tote is so cute and light! #matchabeartote #ad

source: 난 왜 이렇게 한심한 거야!!!!
en_us: why am I such a loser?!?!

source: 절 아세요?
en_us: you know me?

source: 너 박지원이랑 헤어졌다며!!!!
en_us: I heard you broke up with jiwan!!!!

source: 안 돼~!!
en_us: noooo!!!

source: 총총총
en_us: TAP TAP TAP

source: 나코짱 기다리라굿~!!
en_us: nako-chan! I’m comiiing!!!

source: 나이스~ 마지막 두부 겟또다제
en_us: nice! the last tofu! gettodaze (I got it)!

source: 살이 많이 빠지셨네요~
en_us: you lost a lot of weight!

source: #등교메이크업 #과즙메이크업 #데일리메이크업
en_us: #schoolmakeup #freshmakeup #MOTD

source: 오빠~!!
en_us: minho!!!

source: 야, 넌 닥쳐!!
en_us: shut up!!!

source: 빨랑 안 나와!?
en_us: come out right now!

source: 나도 저 사람들처럼 울퉁불퉁 근육이 생기면 어떡해?
en_us: what if I end up with ugly, bulky muscles like theirs?

source: 자주 있는 일이라서~
en_us: this is something I do often.

source: 그래, 그럼 그러던가…
en_us: sure... if you want...

source: 사실 몇 번 같이 해주고 말 줄 알았는데,
en_us: honestly, I thought you’d only work out with me a couple times,

source: 아니, 그 있잖아!
en_us: remember?!

source: 중간고사 끝난 기념으로 적셔~
en_us: time to celebrate the end of midterms!

source: 1개 400원
en_us: 1 for 40 cents

source: 그럼 요건 압수~!!
en_us: I’ll be confiscating this!!!

source: 우웅?
en_us: hmm?

source: 다음 옷 입고 올게…
en_us: I’ll change to the next set then...

source: 그래, 이겨내보자!
en_us: all right, I’ll do it!

source: 꼭 다시 돌아올테니까!!!
en_us: I’ll be back!!!

source: 헤헤, 오늘은 드디어...
en_us: hehe, finally! today...

source: 헐, 너도 그거 떴어?
en_us: yeah! did it show up on your feed too?

source: 야, 너 진짜 윤시아랑 사귀어?
en_us: hey, are you really dating sia?

source: 윤시아랑 수익은 나누기로 한 거지?
en_us: will you and sia be splitting the profits?

source: 됐다.
en_us: forget it.

source: 외로워!!
en_us: I’m lonely!

source: 그럼 대부분의 시간을 집에서 혼자 보내고 있는 건가...
en_us: does that mean he spends most of his time by himself?

source: 아빠는 친구 데려오면 더 좋아할 걸?
en_us: dad will probably like that anyway.

source: 일시 20XX년 20XX년 9월 10일 장소 서울
en_us: 8 AM - 6 PM, every day Location: Seoul

source: 익명
en_us: Anonymous

source: 난 이게 제일 맘에 드는뎅…
en_us: I like this the best...

source: 나 왔어...
en_us: I’m back...

source: 모해모해???
en_us: what u doin?

source: 야, 야!!
en_us: h-hey!

source: 김민호!
en_us: minho!

source: 시아쨩이랑 약속한 거잖아,
en_us: I made a promise with you, sia-chan,

source: 원푸드 다이어트 하는 법!!
en_us: Single Food Diet, The Proper Way!!

source: 그래...
en_us: okay...

source: 넵
en_us: yup.

source: 먹고 싶다는 욕구보다
en_us: because my desire to change...

source: 훗!
en_us: HEHE

source: 얘는 내 남자침구이자 뉴튜브 파트너 백시원!
en_us: this is siwon baek, my boyfriend and newtube partner.

source: 이 정도면...
en_us: this...

source: 에에!!?
en_us: huh?!!!

source: 그럼...
en_us: on that note...
